results/2018-05-05_17-05-42/simple-get/jetty-server.out
Running 180m test @ http://127.0.0.1:3000/
  3 threads and 500 connections
  Thread calibration: mean lat.: 1.014ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.983ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 5.310ms, rate sampling interval: 16ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.09ms    1.77ms  16.02ms   75.75%
    Req/Sec   172.29    648.35    11.07k    99.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.28ms
 75.000%    3.39ms
 90.000%    4.86ms
 99.000%    7.08ms
 99.900%    8.49ms
 99.990%   10.87ms
 99.999%   12.36ms
100.000%   16.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.152     0.000000            1         1.00
       0.460     0.100000       541279         1.11
       0.721     0.200000      1079536         1.25
       0.948     0.300000      1619194         1.43
       1.125     0.400000      2160677         1.67
       1.279     0.500000      2700469         2.00
       1.360     0.550000      2968413         2.22
       1.464     0.600000      3237515         2.50
       1.816     0.650000      3506629         2.86
       2.849     0.700000      3776564         3.33
       3.393     0.750000      4046310         4.00
       3.611     0.775000      4181857         4.44
       3.823     0.800000      4315980         5.00
       4.045     0.825000      4450602         5.71
       4.283     0.850000      4586971         6.67
       4.547     0.875000      4721501         8.00
       4.699     0.887500      4789381         8.89
       4.859     0.900000      4856006        10.00
       5.031     0.912500      4923002        11.43
       5.223     0.925000      4991064        13.33
       5.431     0.937500      5057731        16.00
       5.547     0.943750      5091401        17.78
       5.671     0.950000      5125314        20.00
       5.807     0.956250      5159376        22.86
       5.955     0.962500      5192594        26.67
       6.135     0.968750      5226722        32.00
       6.235     0.971875      5243219        35.56
       6.347     0.975000      5259969        40.00
       6.471     0.978125      5276699        45.71
       6.611     0.981250      5293924        53.33
       6.759     0.984375      5310582        64.00
       6.839     0.985938      5318849        71.11
       6.927     0.987500      5327453        80.00
       7.019     0.989062      5335796        91.43
       7.123     0.990625      5344218       106.67
       7.243     0.992188      5352698       128.00
       7.311     0.992969      5356941       142.22
       7.379     0.993750      5360976       160.00
       7.463     0.994531      5365349       182.86
       7.551     0.995313      5369413       213.33
       7.655     0.996094      5373684       256.00
       7.715     0.996484      5375798       284.44
       7.779     0.996875      5377876       320.00
       7.847     0.997266      5379908       365.71
       7.935     0.997656      5382075       426.67
       8.039     0.998047      5384170       512.00
       8.099     0.998242      5385189       568.89
       8.171     0.998437      5386242       640.00
       8.255     0.998633      5387307       731.43
       8.367     0.998828      5388363       853.33
       8.511     0.999023      5389402      1024.00
       8.599     0.999121      5389915      1137.78
       8.711     0.999219      5390457      1280.00
       8.839     0.999316      5390984      1462.86
       8.991     0.999414      5391496      1706.67
       9.215     0.999512      5392027      2048.00
       9.327     0.999561      5392288      2275.56
       9.479     0.999609      5392553      2560.00
       9.647     0.999658      5392814      2925.71
       9.823     0.999707      5393073      3413.33
      10.031     0.999756      5393334      4096.00
      10.159     0.999780      5393473      4551.11
      10.263     0.999805      5393601      5120.00
      10.415     0.999829      5393733      5851.43
      10.551     0.999854      5393860      6826.67
      10.719     0.999878      5393992      8192.00
      10.807     0.999890      5394061      9102.22
      10.887     0.999902      5394132     10240.00
      10.967     0.999915      5394192     11702.86
      11.071     0.999927      5394257     13653.33
      11.175     0.999939      5394323     16384.00
      11.255     0.999945      5394360     18204.44
      11.287     0.999951      5394387     20480.00
      11.367     0.999957      5394421     23405.71
      11.471     0.999963      5394454     27306.67
      11.591     0.999969      5394486     32768.00
      11.647     0.999973      5394503     36408.89
      11.711     0.999976      5394519     40960.00
      11.815     0.999979      5394536     46811.43
      11.935     0.999982      5394552     54613.33
      12.031     0.999985      5394568     65536.00
      12.103     0.999986      5394576     72817.78
      12.199     0.999988      5394586     81920.00
      12.287     0.999989      5394593     93622.86
      12.471     0.999991      5394602    109226.67
      12.639     0.999992      5394610    131072.00
      12.695     0.999993      5394613    145635.56
      12.815     0.999994      5394618    163840.00
      12.903     0.999995      5394622    187245.71
      13.407     0.999995      5394626    218453.33
      13.663     0.999996      5394630    262144.00
      13.775     0.999997      5394632    291271.11
      13.791     0.999997      5394634    327680.00
      13.951     0.999997      5394636    374491.43
      14.383     0.999998      5394638    436906.67
      14.535     0.999998      5394640    524288.00
      14.823     0.999998      5394641    582542.22
      14.847     0.999998      5394642    655360.00
      14.943     0.999999      5394643    748982.86
      14.991     0.999999      5394644    873813.33
      15.007     0.999999      5394645   1048576.00
      15.223     0.999999      5394646   1165084.44
      15.223     0.999999      5394646   1310720.00
      15.343     0.999999      5394647   1497965.71
      15.343     0.999999      5394647   1747626.67
      15.495     1.000000      5394648   2097152.00
      15.495     1.000000      5394648   2330168.89
      15.495     1.000000      5394648   2621440.00
      15.607     1.000000      5394649   2995931.43
      15.607     1.000000      5394649   3495253.33
      15.607     1.000000      5394649   4194304.00
      15.607     1.000000      5394649   4660337.78
      15.607     1.000000      5394649   5242880.00
      16.023     1.000000      5394650   5991862.86
      16.023     1.000000      5394650          inf
#[Mean    =        2.088, StdDeviation   =        1.773]
#[Max     =       16.016, Total count    =      5394650]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5400021 requests in 180.01m, 587.08MB read
  Socket errors: connect 0, read 0, write 0, timeout 3
Requests/sec:    499.97
Transfer/sec:     55.66KB